{
    "intents": [
         {
            "tag": "mining_rules_list",
            "patterns": [
                "What are different rules in the mining industry?",
                "Can you list some rules for mining?",
                "Tell me about key regulations in mining.",
                "List the important rules for the mining sector.",
                "What rules govern mining activities?",
                "Explain the regulatory framework for mining.",
                "Share information on mining industry guidelines.",
                "What are the legal requirements for mining operations?",
                "Discuss the rules and regulations in the mining sector.",
                "Can you provide an overview of mining industry standards?",
                "Tell me about the specific rules for mineral extraction.",
                "Explain the laws surrounding mining activities.",
                "List some important rules for responsible mining.",
                "Discuss the key regulations for environmental protection in mining.",
                "What governmental regulations apply to mining?",
                "Explain the role of regulatory bodies in the mining sector.",
                "Are there specific rules for sustainable mining practices?",
                "Tell me about the licensing process for mining operations.",
                "What safety measures are mandated in the mining industry?",
                "Share insights into the rules governing granite conservation in mining."
            ],
            "responses": [
                "Some key rules in the mining industry include:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "Mining regulations play a crucial role in governing activities. Some notable rules are:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "Key regulations in the mining industry include:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "Listed below are some important rules for the mining sector:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "The regulatory framework for mining includes key rules such as:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "Mining industry guidelines encompass rules like:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "Legal requirements for mining operations are outlined in key rules such as:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "Mining sector rules and regulations include:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "An overview of mining industry standards reveals rules like:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "Specific rules for mineral extraction include:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999"
            ]
        },
                {
            "tag": "injured_worker_rights",
            "patterns": [
                "What rights does a person have if they get injured at work?",
                "Can you explain the rights of an employee injured on the job?",
                "What protections are available for workers who suffer injuries in the workplace?",
                "If someone gets hurt at work, what legal rights do they have?",
                "Tell me about the rights of an injured worker.",
                "What are the legal remedies for employees injured during work?",
                "Explain the worker's rights in case of workplace injuries.",
                "If an employee is injured, what entitlements do they have?",
                "Discuss the legal aspects of workplace injuries and employee rights.",
                "What compensation rights does an injured worker have?",
                "Can you list the rights of an employee who sustains an injury at work?",
                "Explain the employer's responsibilities for an injured worker.",
                "What laws protect workers injured on the job?",
                "Tell me about the rights of injured workers according to labor laws.",
                "In case of a workplace injury, what rights does the employee retain?",
                "Discuss the legal recourse for workers injured during employment.",
                "What steps should an injured worker take to protect their rights?",
                "Tell me about the benefits and rights for employees injured at work.",
                "Explain the process of filing a claim for a workplace injury.",
                "What legal options are available to an injured employee in the workplace?"
            ],
            "responses": [
                "When a person is injured at work, they may be entitled to workers' compensation benefits.",
                "Injured workers typically have the right to receive medical treatment and compensation for lost wages.",
                "Workers injured on the job have the right to file a workers' compensation claim.",
                "Employers are generally obligated to provide a safe working environment and compensation for injured employees.",
                "Legal rights for injured workers often include medical care, disability benefits, and rehabilitation services.",
                "Workers' compensation laws vary, but they commonly cover medical expenses and a portion of lost wages.",
                "Injured employees may have the right to pursue legal action against a third party if their injury was caused by someone other than their employer.",
                "Employers are generally prohibited from retaliating against employees who exercise their rights to workers' compensation.",
                "Injured workers have the right to report workplace injuries and file a workers' compensation claim.",
                "Workers' compensation benefits may include coverage for medical bills, rehabilitation, and disability benefits.",
                "Workers' compensation laws are designed to provide a swift resolution for injured employees without the need for lengthy legal battles.",
                "Employees injured at work may have the right to choose their own healthcare provider for treatment.",
                "Injured workers have the right to request an investigation into the circumstances that led to their injury.",
                "Workers' compensation benefits aim to provide financial support and aid in the recovery of injured employees.",
                "Employers are typically required to carry workers' compensation insurance to cover injured workers.",
                "Injured workers may be entitled to vocational rehabilitation services to help them return to work.",
                "Workers' compensation laws protect both the rights of the employee and the employer in the event of a workplace injury.",
                "Injured workers should promptly report their injuries to their employer to preserve their rights to compensation.",
                "Legal rights for injured workers may extend to compensation for pain and suffering.",
                "Workers injured on the job may have the right to appeal decisions related to their workers' compensation claim."
            ]
        },
           {
            "tag": "mining_amendment_act_2012",
            "patterns": [
                "What is the Mining Amendment Act 2012 (WA)?",
                "Can you explain the key changes introduced by the Mining Amendment Act 2012?",
                "Tell me about the amendments brought by the Mining Amendment Act 2012 in Western Australia.",
                "What is the significance of the Mining Amendment Act 2012 for mining regulations?",
                "Explain the provisions of the Mining Amendment Act 2012 (WA).",
                "How has the Mining Amendment Act 2012 impacted mining activities in Western Australia?",
                "What is 'Commonwealth land' in the context of the Mining Amendment Act 2012?",
                "Can you elaborate on the consents required for mining on 'Commonwealth land' under the MAA 2012?",
                "What changes does the Mining Amendment Act 2012 make to mining lease applications for listed companies?",
                "Tell me about the 'resources report' and its role in mining lease applications under the MAA 2012.",
                "How does the Mining Amendment Act 2012 simplify the process of obtaining miscellaneous licences?",
                "What are the purposes 'connected with mining' for which miscellaneous licences can be sought?",
                "Explain the significance of removing the requirement for marking out in the Mining Amendment Act 2012.",
                "How has the effectiveness of the Mining Act 1978 been improved by the Mining Amendment Act 2012?",
                "Can you provide examples of miscellaneous licences for purposes connected with mining?",
                "What is the timeline for the full implementation of the Mining Amendment Act 2012?",
                "Are there any challenges or criticisms associated with the Mining Amendment Act 2012?",
                "What are the benefits of allowing mining on 'Commonwealth land' as per the MAA 2012?",
                "How has the industry responded to the changes introduced by the Mining Amendment Act 2012?",
                "Tell me about the consultation process that preceded the enactment of the Mining Amendment Act 2012."
            ],
            "responses": [
                "The Mining Amendment Act 2012 (WA) is legislation that came into full force on 2 February 2013, introducing changes to the Mining Act 1978 in Western Australia.",
                "Key changes introduced by the Mining Amendment Act 2012 include enabling mining on 'Commonwealth land' with certain consents, allowing listed companies to submit a 'resources report' for mining lease applications, and simplifying miscellaneous licences.",
                "The Mining Amendment Act 2012 in Western Australia addresses various amendments to the Mining Act 1978, enhancing its effectiveness and regulations.",
                "The amendments in the Mining Amendment Act 2012 are significant for refining mining regulations and improving the overall mining process in Western Australia.",
                "Provisions of the Mining Amendment Act 2012 cover aspects such as mining on 'Commonwealth land,' listed companies' mining lease applications, and changes to miscellaneous licences.",
                "The Mining Amendment Act 2012 has had a notable impact on mining activities in Western Australia, streamlining processes and introducing more flexibility.",
                "'Commonwealth land' in the context of the Mining Amendment Act 2012 refers to areas subject to mining with certain consents, as outlined in the legislation.",
                "Mining on 'Commonwealth land' under the MAA 2012 requires specific consents, and the process is outlined in the legislation to ensure responsible mining practices.",
                "Listed companies can now submit a 'resources report' instead of a mining proposal or statement and mineralisation report when applying for mining leases under the Mining Amendment Act 2012.",
                "The 'resources report' plays a key role in mining lease applications, providing essential information about the available resources and the feasibility of the mining project.",
                "The Mining Amendment Act 2012 simplifies the process of obtaining miscellaneous licences by allowing them for purposes 'connected with mining' and removing the requirement for marking out.",
                "Purposes 'connected with mining' for which miscellaneous licences can be sought under the MAA 2012 include activities related to mining operations and associated processes.",
                "Removing the requirement for marking out in the Mining Amendment Act 2012 streamlines administrative processes and contributes to the efficiency of obtaining licences.",
                "The effectiveness of the Mining Act 1978 has been improved by the Mining Amendment Act 2012 through various amendments that address contemporary mining challenges.",
                "Examples of miscellaneous licences for purposes connected with mining may include licenses for exploration, research, or activities supporting mining operations.",
                "The full implementation of the Mining Amendment Act 2012 took place on 2 February 2013, following Royal Assent on 29 November 2012.",
                "Challenges or criticisms associated with the Mining Amendment Act 2012 may include concerns about environmental impact, stakeholder engagement, and the adaptability of the new regulations.",
                "Allowing mining on 'Commonwealth land' as per the MAA 2012 benefits the industry by opening up new areas for exploration and resource extraction.",
                "The industry has generally responded positively to the changes introduced by the Mining Amendment Act 2012, appreciating the improvements in efficiency and flexibility.",
                "The enactment of the Mining Amendment Act 2012 likely involved a consultation process with industry stakeholders, regulatory bodies, and the public to gather input and ensure balanced regulations."
            ]
        },
         {
            "tag": "mining_regulations",
            "patterns": [
                "What does the Mining Act Regulation cover?",
                "Can you explain the scope of mining regulations?",
                "How is the mining industry regulated?",
                "Tell me about the licenses and permits under mining regulations.",
                "What is the process for obtaining a mining license?",
                "Explain the environmental impact assessment in mining regulations.",
                "What health and safety standards are enforced in mining?",
                "How are reclamation and mine closure addressed in regulations?",
                "What are the community engagement requirements in mining regulations?",
                "Describe the reporting and record-keeping obligations for mining companies.",
                "What measures are in place for ensuring compliance with mining regulations?",
                "Tell me about penalties for violations in mining regulations.",
                "How is the appeals process structured in mining regulations?",
                "Can you provide examples of stakeholder consultation in mining regulations?",
                "What role do environmental permits play in mining regulations?",
                "Explain the financial assurances required for mine closure.",
                "Tell me about community development initiatives outlined in mining regulations.",
                "How are production data and environmental reports submitted?",
                "What agencies enforce mining regulations?",
                "How often are mining regulations updated or amended?"
            ],
            "responses": [
                "The Mining Act Regulation typically covers various aspects of mining activities, including licensing, environmental protection, and community engagement.",
                "Mining regulations define the scope and purpose of governing mining activities, ensuring responsible and sustainable practices.",
                "The mining industry is regulated through specific laws and regulations, such as the Mining Act Regulation, to maintain environmental and social standards.",
                "Mining licenses and permits include exploration permits, mining leases, and environmental permits, each serving a specific purpose in the industry.",
                "The process for obtaining a mining license involves submitting documentation, paying fees, and obtaining approval from regulatory authorities.",
                "Environmental impact assessments are conducted before mining operations to evaluate and mitigate potential environmental effects, as required by mining regulations.",
                "Mining regulations enforce health and safety standards to protect workers and the surrounding community from potential hazards.",
                "Reclamation and mine closure procedures are outlined in mining regulations, emphasizing the restoration of affected land and financial assurances for closure.",
                "Community engagement requirements in mining regulations focus on consultation, benefit-sharing agreements, and community development initiatives.",
                "Mining companies must adhere to reporting and record-keeping obligations, including submissions of production data, environmental reports, and financial disclosures.",
                "Compliance with mining regulations is ensured through monitoring, reporting, and enforcement mechanisms by regulatory authorities.",
                "Penalties for violations of mining regulations may include fines, license revocation, and legal actions to discourage non-compliance.",
                "The appeals process in mining regulations provides a mechanism for parties to challenge decisions related to licenses or enforcement actions.",
                "Stakeholder consultation in mining regulations involves engaging with communities, industry stakeholders, and environmental groups to gather input and ensure transparency.",
                "Environmental permits are a crucial part of mining regulations, addressing the impact of mining activities on the environment and specifying permissible limits.",
                "Financial assurances for mine closure, as required by mining regulations, ensure that companies have the resources to rehabilitate the mining site once operations cease.",
                "Community development initiatives outlined in mining regulations aim to contribute positively to the well-being of local communities affected by mining activities.",
                "Production data and environmental reports are typically submitted at regular intervals, providing insights into the mining company's operations and their environmental impact.",
                "Agencies responsible for enforcing mining regulations include regulatory bodies, environmental agencies, and health and safety authorities.",
                "Mining regulations are subject to periodic updates or amendments to reflect changes in industry practices, technology, and environmental standards."
            ]
        },
         {
            "tag": "mines_act_1952",
            "patterns": [
                "What is The Mines Act, 1952?",
                "Can you explain the provisions of The Mines Act, 1952?",
                "Tell me about the health and safety measures in The Mines Act, 1952.",
                "What types of mines are covered by The Mines Act, 1952?",
                "Explain the duties of mine owners under The Mines Act, 1952.",
                "How does The Mines Act, 1952 address worker welfare in mines?",
                "What are the key objectives of The Mines Act, 1952?",
                "Tell me about the management of mines according to The Mines Act, 1952.",
                "What is the significance of The Mines Act, 1952 in the mining industry?",
                "How does The Mines Act, 1952 contribute to mine safety?",
                "What are the obligations of mine owners in terms of health and safety?",
                "Explain the role of The Mines Act, 1952 in regulating metalliferous mines.",
                "How does The Mines Act, 1952 impact oil mines?",
                "Can you provide examples of health and safety measures outlined in The Mines Act, 1952?",
                "Tell me about the welfare provisions for workers under The Mines Act, 1952.",
                "What penalties or consequences are specified in The Mines Act, 1952 for non-compliance?",
                "How has The Mines Act, 1952 evolved over time?",
                "What authorities are responsible for enforcing The Mines Act, 1952?",
                "Are there any recent amendments to The Mines Act, 1952?",
                "Explain the jurisdiction of The Mines Act, 1952."
            ],
            "responses": [
                "The Mines Act, 1952 contains provisions for health, safety, and welfare measures for workers in coal, metalliferous, and oil mines.",
                "The Mines Act, 1952 outlines the duties of mine owners in managing mining operations and ensuring health and safety in mines.",
                "Health and safety measures in The Mines Act, 1952 are designed to protect workers in coal, metalliferous, and oil mines.",
                "The Mines Act, 1952 covers various types of mines, including coal, metalliferous, and oil mines.",
                "Duties of mine owners under The Mines Act, 1952 include managing mines, ensuring health and safety, and promoting worker welfare.",
                "The Mines Act, 1952 addresses worker welfare by prescribing measures to enhance the well-being of workers in mines.",
                "The key objectives of The Mines Act, 1952 include promoting the health, safety, and welfare of workers in different types of mines.",
                "The Mines Act, 1952 specifies the responsibilities of mine owners in managing and operating mines.",
                "The Mines Act, 1952 is significant in the mining industry as it establishes regulations for ensuring the well-being of workers and safe mining operations.",
                "The Mines Act, 1952 contributes to mine safety by setting standards and obligations for mine owners and operators.",
                "Obligations of mine owners in terms of health and safety are outlined in The Mines Act, 1952 to prevent accidents and promote a safe working environment.",
                "The Mines Act, 1952 regulates metalliferous mines by setting forth guidelines for health, safety, and welfare measures.",
                "The Mines Act, 1952 also has provisions impacting oil mines, extending its regulations to cover different types of mining operations.",
                "Examples of health and safety measures in The Mines Act, 1952 include protocols for ventilation, accident prevention, and emergency response.",
                "Welfare provisions for workers under The Mines Act, 1952 encompass aspects such as housing, medical facilities, and social amenities.",
                "Penalties for non-compliance with The Mines Act, 1952 may include fines, closure of mines, or legal consequences for mine owners.",
                "The Mines Act, 1952 may have evolved over time with amendments to address changing industry needs and standards.",
                "Enforcement of The Mines Act, 1952 is the responsibility of authorities overseeing mining operations and ensuring compliance with regulations.",
                "Recent amendments to The Mines Act, 1952 may have occurred to adapt to modern mining practices and advancements.",
                "The jurisdiction of The Mines Act, 1952 extends to coal, metalliferous, and oil mines, outlining regulations for each type of mining operation."
            ]
        },
        {
            "tag": "latest_mining_act_amendment",
            "patterns": [
                "What is the latest amendment to the Mines and Minerals (Development and Regulation) Act?",
                "Can you provide information about the most recent changes to the mining legislation?",
                "Tell me about the Mines and Minerals (Development and Regulation) Amendment Act, 2023.",
                "What updates were made to the Mines and Minerals Act in 2023?",
                "When was the latest amendment to the mining act passed?",
                "Explain the key provisions of the Mines and Minerals (Development and Regulation) Amendment Act, 2023.",
                "What changes were introduced by the Mines and Minerals Act in August 2023?",
                "How does the latest amendment impact mining operations?",
                "Can you summarize the Mines and Minerals (Development and Regulation) Amendment Act, 2023?",
                "Tell me about the significance of the latest amendment to the mining act.",
                "What is the official title of the Mines and Minerals Act amendment passed on August 9, 2023?",
                "Are there any notable amendments to the mining legislation in 2023?",
                "Discuss the implications of the latest Mines and Minerals Act amendment on the mining industry.",
                "What are the key dates associated with the Mines and Minerals (Development and Regulation) Amendment Act, 2023?",
                "How has the mining regulatory landscape changed with the latest amendment?",
                "Tell me about the legislative process leading to the Mines and Minerals Act amendment in 2023.",
                "What sectors of mining does the latest amendment cover?",
                "Has there been any public reaction to the Mines and Minerals Act changes in 2023?",
                "Explain the objectives behind the Mines and Minerals (Development and Regulation) Amendment Act, 2023.",
                "Are there any specific areas of focus in the latest amendment to the mining act?"
            ],
            "responses": [
                "The latest amendment to the Mines and Minerals (Development and Regulation) Act is the Mines and Minerals (Development and Regulation) Amendment Act, 2023.",
                "As of August 9, 2023, the Mines and Minerals Act has been further amended by the Mines and Minerals (Development and Regulation) Amendment Act.",
                "The Mines and Minerals (Development and Regulation) Amendment Act, 2023 was passed on August 9, 2023, further amending the existing mining legislation.",
                "The key provisions of the Mines and Minerals (Development and Regulation) Amendment Act, 2023 include various changes to the regulatory framework governing mining operations.",
                "The latest amendment to the mining act, known as the Mines and Minerals (Development and Regulation) Amendment Act, 2023, impacts mining operations by introducing new regulations and modifying existing ones.",
                "The Mines and Minerals (Development and Regulation) Amendment Act, 2023, has made notable changes to the mining legislation, addressing various aspects of the sector.",
                "The Mines and Minerals Act amendment in August 2023 brings significant changes to the regulatory landscape governing mining activities.",
                "The Mines and Minerals (Development and Regulation) Amendment Act, 2023, has implications for the mining industry, affecting how mining operations are conducted.",
                "The Mines and Minerals Act amendment in 2023 is significant for the mining sector, bringing about changes aimed at improving the regulation and management of mining activities.",
                "The official title of the Mines and Minerals Act amendment passed on August 9, 2023, is the Mines and Minerals (Development and Regulation) Amendment Act, 2023.",
                "The Mines and Minerals Act underwent notable amendments in 2023, with the Mines and Minerals (Development and Regulation) Amendment Act introducing key changes to the legislation.",
                "The latest Mines and Minerals Act amendment in 2023 has implications for the mining industry, impacting various stakeholders and sectors within the field.",
                "The Mines and Minerals (Development and Regulation) Amendment Act, 2023, addresses changes in the mining industry, affecting how mining operations are regulated and conducted.",
                "Key dates associated with the Mines and Minerals (Development and Regulation) Amendment Act, 2023, include its passage on August 9, 2023.",
                "The mining regulatory landscape has changed with the latest amendment to the Mines and Minerals Act, introducing new provisions and modifying existing ones.",
                "The legislative process leading to the Mines and Minerals (Development and Regulation) Amendment Act, 2023, involved steps to amend and update the existing mining legislation.",
                "The latest amendment to the Mines and Minerals Act in 2023 covers various sectors of mining, addressing specific aspects of the industry.",
                "Public reactions to the Mines and Minerals Act changes in 2023 may vary, and stakeholders may have different perspectives on the amendments.",
                "The objectives behind the Mines and Minerals (Development and Regulation) Amendment Act, 2023, include improving the regulatory framework, enhancing environmental protections, and addressing industry challenges.",
                "The latest amendment to the mining act in 2023 focuses on specific areas such as environmental sustainability, worker safety, and efficient mining practices."
            ]
        },
        {
            "tag": "mine_safety_rules",
            "patterns": [
                "What are the safety rules in mines?",
                "Can you explain the mine safety regulations?",
                "Tell me about the rules for ensuring safety in mining operations.",
                "What safety measures should be followed in mines?",
                "Explain the safety guidelines for mine workers.",
                "Are there specific rules for mine safety?",
                "Discuss the importance of safety in mining.",
                "What equipment is required for mine safety?",
                "Tell me about the safety protocols in mining.",
                "How can mine accidents be prevented?",
                "What are the key safety procedures for mine workers?",
                "Explain the role of safety equipment in mining.",
                "Are there any specific guidelines for underground mining safety?",
                "Discuss the importance of wearing safety equipment in mines.",
                "What measures are in place for preventing mine hazards?",
                "How is worker safety ensured in mining?",
                "Tell me about the training programs for mine safety.",
                "What should mine workers do to ensure their safety?",
                "Discuss the use of helmets in mine safety.",
                "Are there any stories of safety equipment saving mine workers?"
            ],
            "responses": [
                "Mine safety rules are essential guidelines to ensure the well-being of workers and prevent accidents in mining operations.",
                "Safety regulations in mines cover a range of measures aimed at protecting workers and maintaining a secure working environment.",
                "Rules for ensuring safety in mining operations encompass various protocols and procedures designed to minimize hazards.",
                "Safety measures in mines include the use of personal protective equipment, adherence to protocols, and ongoing training for workers.",
                "Safety guidelines for mine workers are established to create a secure working environment and prevent accidents.",
                "Specific rules for mine safety are implemented to address the unique challenges and hazards associated with mining operations.",
                "The importance of safety in mining cannot be overstated, as it protects workers and contributes to the overall well-being of the mining industry.",
                "Mine safety requires the use of various safety equipment, including helmets, safety glasses, gloves, and other protective gear.",
                "Safety protocols in mining involve systematic procedures and practices to ensure the well-being of workers and prevent accidents.",
                "Preventing mine accidents involves strict adherence to safety protocols, regular training, and maintaining equipment in good condition.",
                "Key safety procedures for mine workers include following established protocols, using safety equipment, and participating in training programs.",
                "Safety equipment plays a crucial role in mining, providing protection to workers and often preventing severe injuries.",
                "Specific guidelines for underground mining safety address the unique challenges posed by working in confined and underground spaces.",
                "Wearing safety equipment in mines is crucial, as it provides essential protection and has been instrumental in saving workers from accidents.",
                "Measures to prevent mine hazards include risk assessments, hazard identification, and the implementation of safety protocols.",
                "Worker safety in mining is ensured through a combination of regulations, training programs, and the use of safety equipment.",
                "Training programs for mine safety cover various aspects, including emergency response, hazard recognition, and the proper use of safety equipment.",
                "To ensure their safety, mine workers should follow established safety protocols, use protective equipment, and report any hazards immediately.",
                "The use of helmets is a fundamental aspect of mine safety, providing protection against head injuries and saving workers in various incidents.",
                "There are numerous stories of safety equipment, such as helmets, saving mine workers from serious injuries and even fatalities."
            ]
        },
        {
            "tag": "coal_mine_act_1952",
            "patterns": [
                "What is the Coal Mines Act, 1952?",
                "Can you provide information about the Mines Act as it relates to coal mines?",
                "Explain the provisions of the Coal Mines Act, 1952.",
                "Tell me about the regulations for coal mines under the Mines Act, 1952.",
                "What are the key features of the Mines Act, 1952, concerning coal mining?",
                "How does the Mines Act, 1952, impact workers in coal mines?",
                "Discuss the purpose of the Coal Mines Act, 1952.",
                "What conditions does the Mines Act, 1952, aim to regulate in coal mines?",
                "Are there limitations on employment specified in the Coal Mines Act, 1952?",
                "Explain the hours of work outlined in the Mines Act, 1952, for coal mine workers.",
                "How has the Mines Act, 1952, adjusted the working conditions of coal mine workers?",
                "Tell me about the significance of the Mines Act, 1952, for coal mining.",
                "Are there specific safety regulations for coal mines in the Mines Act, 1952?",
                "Discuss the relationship between the Mines Act, 1952, and coal mine workers.",
                "Explain any recent amendments to the Mines Act, 1952, affecting coal mines.",
                "What obligations does the Mines Act, 1952, impose on coal mine owners?",
                "How does the Mines Act, 1952, contribute to the welfare of coal mine workers?",
                "Tell me about any notable cases or incidents related to the Mines Act, 1952, in coal mining.",
                "Discuss the enforcement mechanisms of the Mines Act, 1952, in coal mines.",
                "Are there any proposed changes to the Mines Act, 1952, with regards to coal mining?"
            ],
            "responses": [
                "The Coal Mines Act, 1952, is a legislation enacted to regulate the working conditions of coal mine workers.",
                "The Mines Act, 1952, includes provisions specific to coal mines, outlining regulations and conditions for workers.",
                "Provisions of the Coal Mines Act, 1952, address various aspects, including hours of work and limitations on employment in coal mines.",
                "The Mines Act, 1952, establishes regulations for coal mines, covering safety, hours of work, and other conditions of employment.",
                "Key features of the Mines Act, 1952, related to coal mining focus on ensuring the welfare and rights of workers in this sector.",
                "The Mines Act, 1952, impacts workers in coal mines by setting standards for working conditions and employment limitations.",
                "The purpose of the Coal Mines Act, 1952, is to regulate and improve the working conditions of individuals employed in coal mines.",
                "The Mines Act, 1952, aims to regulate conditions in coal mines, addressing aspects like working hours and employment limitations.",
                "The Coal Mines Act, 1952, specifies limitations on employment and outlines the hours of work for coal mine workers.",
                "Hours of work in the Mines Act, 1952, for coal mine workers are designed to ensure reasonable working hours and promote worker well-being.",
                "The Mines Act, 1952, has adjusted the working conditions of coal mine workers to provide a safer and healthier working environment.",
                "The Mines Act, 1952, is significant for coal mining as it establishes a legal framework for regulating conditions and ensuring worker welfare.",
                "Safety regulations for coal mines are covered under the Mines Act, 1952, as part of its commitment to worker protection and well-being.",
                "The Mines Act, 1952, defines the relationship between the legislation and coal mine workers, emphasizing their rights and protections.",
                "Recent amendments to the Mines Act, 1952, may impact coal mines, introducing changes to regulations and working conditions.",
                "Coal mine owners have obligations under the Mines Act, 1952, to comply with regulations, ensuring the safety and welfare of their workers.",
                "The Mines Act, 1952, contributes to the welfare of coal mine workers by establishing standards and protections for their working conditions.",
                "Notable cases or incidents related to the Mines Act, 1952, in coal mining may highlight the enforcement and impact of the legislation.",
                "Enforcement mechanisms of the Mines Act, 1952, in coal mines involve regulatory oversight and penalties for non-compliance.",
                "Proposed changes to the Mines Act, 1952, with regards to coal mining may be considered to address evolving industry needs and standards."
            ]
        },
         {
            "tag": "latest_mining_news",
            "patterns": [
                "What is the latest news in the mining industry?",
                "Can you provide updates on the mining sector?",
                "Tell me about the recent developments in the mining industry.",
                "What are the current trends in the mining sector?",
                "Explain the latest news and events in mining.",
                "Are there any notable changes in the mining industry recently?",
                "Discuss the updates in the mining sector for 2023.",
                "Tell me about the challenges faced by the mining industry.",
                "What is the outlook for the mining industry in the near future?",
                "Explain the impacts of changing demand on the mining sector.",
                "How are supply costs affecting the mining industry?",
                "What are the emerging trends in mining for 2023?",
                "Discuss the shift away from coal in the mining industry.",
                "Tell me about the role of renewable energies in the mining sector.",
                "What are the key takeaways from the assessment of mining trends in 2023?",
                "Explain the factors influencing the mining industry's trajectory.",
                "How is the world adapting to changes in the mining industry?",
                "Are there any policy changes affecting the mining sector?",
                "Discuss the technological advancements in the mining industry.",
                "What are experts saying about the current state of the mining industry?"
            ],
            "responses": [
                "The latest news in the mining industry includes an assessment of trends revealing challenges related to rising supply costs and changing demand.",
                "Updates on the mining sector highlight recent developments, challenges, and trends shaping the industry's trajectory.",
                "Recent developments in the mining industry cover a range of topics, including market dynamics, technological advancements, and environmental considerations.",
                "Current trends in the mining sector involve factors such as supply chain disruptions, advancements in technology, and shifts in global demand.",
                "The latest news and events in mining explore the industry's response to various challenges and opportunities, impacting stakeholders worldwide.",
                "Notable changes in the mining industry are being observed, reflecting shifts in market dynamics, regulations, and environmental concerns.",
                "Updates in the mining sector for 2023 encompass a comprehensive overview of industry trends, challenges, and potential opportunities.",
                "Challenges faced by the mining industry may include environmental concerns, regulatory changes, and adapting to evolving market demands.",
                "The outlook for the mining industry involves considerations of market trends, geopolitical factors, and the industry's response to global challenges.",
                "Changing demand in the mining sector is influencing industry players to adapt to shifts in consumer preferences and environmental consciousness.",
                "Supply costs are a critical factor affecting the mining industry, posing challenges and prompting strategies to manage operational expenses.",
                "Emerging trends in mining for 2023 include increased adoption of sustainable practices, digitalization, and innovations in extraction technologies.",
                "The shift away from coal in the mining industry is driven by environmental concerns and a global push towards cleaner, renewable energy sources.",
                "Renewable energies are playing an increasingly important role in the mining sector, with a focus on sustainable practices and reducing the industry's carbon footprint.",
                "Key takeaways from the assessment of mining trends in 2023 include insights into market dynamics, technological advancements, and environmental considerations.",
                "Factors influencing the mining industry's trajectory include geopolitical shifts, market demands, regulatory changes, and advancements in mining technologies.",
                "The world is adapting to changes in the mining industry by exploring sustainable practices, embracing technological innovations, and addressing environmental concerns.",
                "Policy changes affecting the mining sector may include new regulations, environmental standards, and initiatives to promote responsible mining practices.",
                "Technological advancements in the mining industry encompass innovations in automation, artificial intelligence, and sustainable mining practices.",
                "Experts in the field are providing insights into the current state of the mining industry, addressing challenges and opportunities for stakeholders."
            ]
        },




        {
            "tag": "greetings",
            "patterns": [
                "Hi",
                "Hello",
                "Hey",
                "How are you",
                "What's up",
                "Good day"
            ],
            "responses": [
                "Hello! How can I assist you today?",
                "Hi there! How can I help you?",
                "Hey! What can I do for you?",
                "I'm just a chatbot, but I'm here to help. What's on your mind?",
                "Greetings! Is there something specific you'd like to know or discuss?"
            ]
        },
        {
            "tag": "farewell",
            "patterns": [
                "Goodbye",
                "Bye",
                "See you later",
                "Take care",
                "Farewell"
            ],
            "responses": [
                "Goodbye! If you have more questions, feel free to ask.",
                "Bye! Have a great day!",
                "See you later! If you need assistance, I'll be here.",
                "Take care! Feel free to return if you have more inquiries.",
                "Farewell! If there's anything else you'd like to know, just ask."
            ]
        },
        {
            "tag": "employment_hours",
            "patterns": [
                "What are the hours and limitations of employment?",
                "Can you explain the working hours in mines?",
                "Tell me about the limitations on working hours in the mining industry.",
                "What is the maximum working time allowed in mines?",
                "Explain the rules regarding hours of work in mining.",
                "Discuss the limitations on employment hours in the mining sector.",
                "How many hours can a person work in a mine?",
                "Tell me about the rest day policy in mining employment.",
                "What are the restrictions on weekly working hours in mines?",
                "Explain the daily and weekly working hour limits for mine workers.",
                "Discuss the regulations for hours of work in mining operations.",
                "Can you provide information on Form A for maintaining work hour records?",
                "What is the weekly day of rest policy for mine workers?",
                "Tell me about the maximum working hours below ground in a mine.",
                "Explain the notice requirements for hours of work in a mine.",
                "Discuss the regulations for working hours in the mining industry.",
                "How many days a week can a person work in a mine?",
                "Tell me about the rest day notice displayed in mine offices.",
                "Explain the limitations on working hours below ground in a mine.",
                "Discuss the documentation required for maintaining work hour records in mines."
            ],
            "responses": [
                "No person shall be allowed to work more than 9 hours a day and more than 48 hours a week in a mine. Additionally, a person shall not be allowed to work more than 6 days in a week, ensuring at least 1 day of rest.",
                "The working hours in mines are regulated to ensure that no person works more than 9 hours a day and more than 48 hours a week. A minimum of 1 day of rest is mandated per week.",
                "Limitations on working hours in the mining industry include a maximum of 9 hours per day, 48 hours per week, and a requirement of at least 1 day of rest per week for mine workers.",
                "In the mining industry, no person is allowed to work beyond 9 hours a day and 48 hours a week. There must be at least 1 day of rest in a week for every mine worker.",
                "The rules regarding hours of work in mining stipulate that no person shall work more than 9 hours a day and 48 hours a week. A weekly day of rest is mandatory, ensuring a balanced work schedule.",
                "Limitations on employment hours in the mining sector involve a maximum of 9 hours per day and 48 hours per week. Additionally, there must be at least 1 day of rest in a week for mine workers.",
                "Mine workers are restricted to working not more than 9 hours a day and 48 hours a week, with a mandatory rest day of at least 1 day per week.",
                "The restrictions on weekly working hours in mines include a maximum of 48 hours, and no person shall be allowed to work more than 9 hours a day. A rest day of at least 1 day per week is required.",
                "For mine workers, the daily limit for work is 9 hours, and the weekly limit is 48 hours. There must be at least 1 day of rest in a week for every individual.",
                "The regulations for hours of work in mining operations specify that no person shall work more than 9 hours a day and 48 hours a week. A weekly rest day is mandatory.",
                "Form A is used for maintaining records of hours of work in mines, ensuring compliance with the regulations. It captures details of daily and weekly working hours for mine workers.",
                "The weekly day of rest policy in mining employment ensures that no person works more than 6 days in a week. The office of every mine displays a notice showing the weekly day of rest for workers.",
                "Below ground in a mine, no person is allowed to work beyond eight hours a day and 48 hours a week. This regulation ensures the well-being of mine workers.",
                "The notice requirements for hours of work in a mine include displaying a notice showing the weekly day of rest. If the day of rest is different for different groups, the notice must indicate the day for each group or individual.",
                "Regulations for working hours in the mining industry mandate that no person works more than 9 hours a day and 48 hours a week. A rest day of at least 1 day per week is required for every mine worker.",
                "Mine workers are restricted to working not more than 9 hours a day and 48 hours a week. The documentation for maintaining work hour records is done in Form A as per the regulations.",
                "The regulations for working hours in the mining industry ensure that no person works more than 9 hours a day and 48 hours a week. There must be at least 1 day of rest in a week.",
                "In a mine, a person is not allowed to work more than 9 hours a day and 48 hours a week. A weekly day of rest is mandatory for the well-being of mine workers.",
                "The notice displayed in mine offices regarding the weekly day of rest is a crucial aspect of the regulations, ensuring that mine workers are aware of their scheduled rest day.",
                "Limitations on working hours below ground in a mine include a maximum of eight hours a day and 48 hours a week, providing safety and well-being for mine workers.",
                "The documentation required for maintaining work hour records in mines is done using Form A, capturing details of daily and weekly working hours for compliance with regulations."
            ]
        },
         {
            "tag": "overtime_wages",
            "patterns": [
                "How are overtime wages determined?",
                "What is the rate for overtime pay?",
                "Can you explain the wages for working overtime?",
                "Tell me about the payment for overtime work.",
                "What are the rules for overtime wages?",
                "Explain the rate of overtime pay in mines.",
                "Discuss how overtime wages are calculated.",
                "What is the normal rate for working extra hours?",
                "Tell me about the compensation for working beyond regular hours.",
                "Explain the policy for paying overtime in the mining industry.",
                "How are wages determined for working more than the normal hours?",
                "Discuss the rate of overtime wages in mines.",
                "What is the formula for calculating overtime pay?",
                "Can you provide information on Form I for maintaining overtime wage records?",
                "Tell me about the register of overtime wages in mining.",
                "Explain the rules for compensating overtime in mines.",
                "What is the standard rate for overtime pay?",
                "Discuss the regulations for overtime wages in the mining sector.",
                "How are overtime wages documented?",
                "Tell me about the register used for recording overtime wages."
            ],
            "responses": [
                "Where any person works more than the normal prescribed hours, he should be paid for his overtime at the rate which is twice than the normal wages paid to him for the work. The register of overtime wages shall be maintained in Form I.",
                "Overtime wages are determined at a rate that is twice the normal wages paid for the work. This ensures fair compensation for individuals working beyond the prescribed hours. The register of overtime wages is maintained in Form I.",
                "For working more than the normal hours, individuals are compensated with overtime pay at a rate that is twice their normal wages. The register of overtime wages is recorded in Form I to ensure transparency and compliance.",
                "The rate for overtime pay is set at twice the normal wages for the work performed. This policy ensures fair compensation for individuals who work beyond the prescribed hours. The register of overtime wages is maintained in Form I.",
                "Rules for overtime wages dictate that any person working more than the normal prescribed hours should be paid at a rate that is twice their normal wages. The register of overtime wages is documented in Form I.",
                "The rate of overtime pay in mines is set at twice the normal wages for the work. This ensures that individuals are fairly compensated for working beyond the regular hours. The register of overtime wages is maintained in Form I.",
                "Overtime wages are calculated at a rate that is twice the normal wages paid for the work. This provides fair compensation to individuals working beyond the prescribed hours. The register of overtime wages is recorded in Form I.",
                "The normal rate for working extra hours is compensated with overtime pay at a rate that is twice the standard wages. This policy ensures fair compensation for individuals working beyond regular hours. The register of overtime wages is maintained in Form I.",
                "Compensation for working beyond regular hours involves paying overtime wages at a rate that is twice the normal wages for the work performed. The register of overtime wages is documented in Form I to ensure accuracy and compliance.",
                "The policy for paying overtime in the mining industry stipulates that individuals working more than the normal hours should be compensated at a rate that is twice their normal wages. The register of overtime wages is maintained in Form I.",
                "Wages for working more than the normal hours are determined at a rate that is twice the normal wages paid for the work. This ensures fair compensation for individuals exceeding the prescribed hours. The register of overtime wages is documented in Form I.",
                "The rate of overtime wages in mines is set at twice the normal wages for the work performed. This policy ensures fair compensation for individuals working beyond the regular hours. The register of overtime wages is maintained in Form I.",
                "The formula for calculating overtime pay involves paying at a rate that is twice the normal wages for the work performed. This policy ensures fair compensation for individuals working beyond the prescribed hours. The register of overtime wages is documented in Form I.",
                "Form I is used for maintaining records of overtime wages in mines. It captures details of overtime pay at a rate that is twice the normal wages for the work performed, ensuring compliance with regulations.",
                "The register of overtime wages in mining is maintained in Form I, recording details of compensation for individuals working beyond the regular hours. This ensures transparency and compliance with regulations.",
                "Rules for compensating overtime in mines dictate that individuals working more than the normal hours should be paid at a rate that is twice their normal wages. The register of overtime wages is maintained in Form I.",
                "The standard rate for overtime pay is set at twice the normal wages for the work performed. This policy ensures fair compensation for individuals working beyond the regular hours. The register of overtime wages is documented in Form I.",
                "Regulations for overtime wages in the mining sector specify compensating at a rate that is twice the normal wages for the work. This policy ensures fair compensation for individuals working beyond the prescribed hours. The register of overtime wages is maintained in Form I.",
                "Overtime wages are documented using a register, with compensation at a rate that is twice the normal wages for the work performed. This ensures fair and accurate records in compliance with regulations.",
                "The register used for recording overtime wages is Form I, capturing details of compensation at a rate that is twice the normal wages for the work performed. This ensures accurate documentation and compliance with regulations."
            ]
        },
        {
            "tag": "employment_of_women",
            "patterns": [
                "What are the rules for employing women in mines?",
                "Can women work in all parts of a mine?",
                "Explain the regulations regarding the employment of women in mining.",
                "Tell me about the hours during which women can be employed in mines.",
                "Are there restrictions on women working below ground in mines?",
                "Discuss the policy for employing women in the mining industry.",
                "What are the limitations on the employment of women in mines?",
                "Can women be employed in mines at any time?",
                "Explain the rules for the working hours of women in mining operations.",
                "Tell me about the conditions for employing women in mines.",
                "Are there specific regulations for the employment of women below ground in mines?",
                "Discuss the hours during which women can work in above-ground mining activities.",
                "What are the guidelines for employing women in the mining sector?",
                "Can you elaborate on the restrictions on women's employment in mines?",
                "Tell me about the policy regarding the employment of women below ground in mines.",
                "Are there any time restrictions for employing women in above-ground mining?",
                "Explain the regulations for women's employment in the mining industry.",
                "What is the policy for the employment of women in mining operations?",
                "Discuss the conditions under which women can be employed in mines.",
                "Are there specific rules for the hours of work for women in mining?"
            ],
            "responses": [
                "No woman shall be employed:\n in any part of a mine which is below-ground\n in any mine above ground except between the hours 6 am and 7 pm",
                "The rules for employing women in mines stipulate that no woman can be employed in any part of a mine below ground. Above ground, women can only be employed between the hours of 6 am and 7 pm.",
                "Regulations regarding the employment of women in mining include the prohibition of employing women below ground in any part of a mine. Above ground, women can only be employed between the hours of 6 am and 7 pm.",
                "Women cannot be employed in any part of a mine below ground. Above ground, women can only be employed between the hours of 6 am and 7 pm, as per the regulations.",
                "The policy for employing women in the mining industry prohibits their employment in any part of a mine below ground. Above ground, women can only be employed between the hours of 6 am and 7 pm.",
                "The limitations on the employment of women in mines include the restriction that no woman can be employed below ground in any part of a mine. Above ground, women can only be employed between the hours of 6 am and 7 pm.",
                "Women cannot be employed in any part of a mine below ground. Above ground, their employment is restricted to the hours between 6 am and 7 pm, as per the policy.",
                "The rules for the working hours of women in mining operations specify that no woman shall be employed in any part of a mine below ground. Above ground, women can only be employed between the hours of 6 am and 7 pm.",
                "Conditions for employing women in mines include the restriction that no woman shall be employed below ground. Above ground, women can only be employed between the hours of 6 am and 7 pm.",
                "No woman can be employed in any part of a mine below ground. Above ground, the rules for the employment of women specify that they can only be employed between the hours of 6 am and 7 pm.",
                "Specific regulations for the employment of women below ground in mines dictate that no woman shall be employed in any part of a mine below ground. Above ground, women can only be employed between the hours of 6 am and 7 pm.",
                "The hours during which women can work in above-ground mining activities are restricted to between 6 am and 7 pm. Below ground, no woman shall be employed in any part of a mine.",
                "Guidelines for employing women in the mining sector include the prohibition of employing women in any part of a mine below ground. Above ground, women can only be employed between the hours of 6 am and 7 pm.",
                "The regulations for the employment of women in mines specify restrictions, including the prohibition of employing women below ground. Above ground, women can only be employed between the hours of 6 am and 7 pm.",
                "The policy regarding the employment of women below ground in mines prohibits such employment. Above ground, women can only be employed between the hours of 6 am and 7 pm.",
                "Time restrictions for employing women in above-ground mining activities are set between 6 am and 7 pm. No woman shall be employed in any part of a mine below ground.",
                "Regulations for women's employment in the mining industry stipulate that no woman shall be employed in any part of a mine below ground. Above ground, women can only be employed between the hours of 6 am and 7 pm.",
                "The policy for the employment of women in mining operations includes the restriction that no woman shall be employed in any part of a mine below ground. Above ground, women can only be employed between the hours of 6 am and 7 pm.",
                "Conditions under which women can be employed in mines include the prohibition of employing women in any part of a mine below ground. Above ground, women can only be employed between the hours of 6 am and 7 pm.",
                "Specific rules for the hours of work for women in mining include the prohibition of employing women in any part of a mine below ground. Above ground, women can only be employed between the hours of 6 am and 7 pm."
            ]
        },
         {
            "tag": "register_maintenance",
            "patterns": [
                "Can you explain the maintenance of the register of persons employed?",
                "What are the requirements for maintaining a register of persons employed?",
                "Tell me about the register of persons employed in mines.",
                "Explain the details included in the register of persons employed.",
                "What information is recorded in the register of persons employed?",
                "Discuss the prescribed particulars for the register of persons employed.",
                "How is the register of persons employed maintained?",
                "Tell me about the documentation of persons employed in mines.",
                "What are the regulations for maintaining a register of persons employed?",
                "Explain the type of information recorded in the register of persons employed.",
                "Can you elaborate on the register of persons employed in mining operations?",
                "Tell me about the register that includes details of persons employed.",
                "What is recorded in the register of persons employed, and how is it maintained?",
                "Discuss the particulars required for the register of persons employed.",
                "How is the register of persons employed different for those working below ground and in open shaft mines?",
                "Tell me about the register that specifies the type of work carried out by individuals.",
                "Explain the regulations regarding the maintenance of the register of persons employed.",
                "What details are captured in the register of persons employed, including age, sex, and address?",
                "Can you provide information on the register of persons employed and its requirements?",
                "Discuss the register that includes details such as name, age, sex, and address of persons employed."
            ],
            "responses": [
                "A register of persons employed should be maintained along with the name of father/husband, age, sex, address, and other prescribed particulars. This register should also specify the type of work being carried out, such as working below the ground and working in an open shaft mine, etc.",
                "The maintenance of the register of persons employed requires recording details such as the name of father/husband, age, sex, address, and other prescribed particulars. The register should also specify the type of work being carried out, including activities below the ground and in open shaft mines.",
                "In mines, a register of persons employed is maintained with details like the name of father/husband, age, sex, address, and other prescribed particulars. The register specifies the type of work being carried out, distinguishing activities below the ground and in open shaft mines.",
                "The register of persons employed in mines includes details such as the name of father/husband, age, sex, address, and other prescribed particulars. Additionally, the register specifies the type of work being carried out, distinguishing activities below the ground and in open shaft mines.",
                "For the maintenance of the register of persons employed, details such as the name of father/husband, age, sex, address, and other prescribed particulars are recorded. The register also specifies the type of work being carried out, including activities below the ground and in open shaft mines.",
                "Prescribed particulars for the register of persons employed include details such as the name of father/husband, age, sex, address, and other relevant information. The register also specifies the type of work being carried out, distinguishing activities below the ground and in open shaft mines.",
                "The maintenance of the register of persons employed involves recording details like the name of father/husband, age, sex, address, and other prescribed particulars. This register also specifies the type of work being carried out, distinguishing activities below the ground and in open shaft mines.",
                "Documentation of persons employed in mines is done through the maintenance of a register. This register includes details such as the name of father/husband, age, sex, address, and other prescribed particulars. It also specifies the type of work being carried out.",
                "Regulations for maintaining a register of persons employed require recording details such as the name of father/husband, age, sex, address, and other prescribed particulars. The register also specifies the type of work being carried out, distinguishing activities below the ground and in open shaft mines.",
                "The type of information recorded in the register of persons employed includes details such as the name of father/husband, age, sex, address, and other prescribed particulars. Additionally, the register specifies the type of work being carried out, distinguishing activities below the ground and in open shaft mines.",
                "The register of persons employed in mining operations includes details such as the name of father/husband, age, sex, address, and other prescribed particulars. It also specifies the type of work being carried out, distinguishing activities below the ground and in open shaft mines.",
                "The register that includes details of persons employed in mines records information such as the name of father/husband, age, sex, address, and other prescribed particulars. This register also specifies the type of work being carried out, distinguishing activities below the ground and in open shaft mines.",
                "Details recorded in the register of persons employed, including the name of father/husband, age, sex, address, and other prescribed particulars, are maintained to specify the type of work being carried out. This distinguishes activities below the ground and in open shaft mines.",
                "The particulars required for the register of persons employed include details such as the name of father/husband, age, sex, address, and other prescribed information. The register also specifies the type of work being carried out, distinguishing activities below the ground and in open shaft mines.",
                "The register of persons employed, including those working below ground and in open shaft mines, specifies the type of work being carried out. Details such as the name of father/husband, age, sex, address, and other prescribed particulars are recorded.",
                "The register that specifies the type of work carried out by individuals includes details such as the name of father/husband, age, sex, address, and other prescribed particulars. This register is maintained to ensure proper documentation of persons employed in mines.",
                "Regulations regarding the maintenance of the register of persons employed require recording details such as the name of father/husband, age, sex, address, and other prescribed particulars. The register also specifies the type of work being carried out, distinguishing activities below the ground and in open shaft mines.",
                "Details captured in the register of persons employed include the name of father/husband, age, sex, address, and other prescribed particulars. The register also specifies the type of work being carried out, distinguishing activities below the ground and in open shaft mines.",
                "The register of persons employed and its requirements involve recording details such as the name of father/husband, age, sex, address, and other prescribed particulars. The register also specifies the type of work being carried out, distinguishing activities below the ground and in open shaft mines.",
                "The register that includes details such as the name of father/husband, age, sex, address, and other prescribed particulars of persons employed is maintained. This register also specifies the type of work being carried out, distinguishing activities below the ground and in open shaft mines."
            ]
        },
         {
            "tag": "leave_with_wages",
            "patterns": [
                "Can you explain the leave with wages policy in mines?",
                "What are the rules for leave with wages for mine employees?",
                "Tell me about the leave entitlement with wages in mines.",
                "How is leave with wages calculated for mine workers?",
                "Discuss the policy for leave with wages for mine employees.",
                "What are the provisions for leave with wages in the mining industry?",
                "Explain the calculation of leave with wages for mine workers.",
                "Tell me about the record-keeping for leave with wages in mines.",
                "What is the formula for calculating leave with wages in mines?",
                "Discuss the conditions for granting leave with wages to mine employees.",
                "Can you elaborate on the leave with wages policy for mine workers?",
                "Tell me about the entitlement of leave with wages in the mining sector.",
                "What are the regulations for leave with wages for mine employees?",
                "Explain the record-keeping forms for leave with wages in mines.",
                "How is leave with wages granted to employees working below ground in mines?",
                "Discuss the provisions for leave with wages for mine workers.",
                "What is the policy for granting leave with wages to mine employees?",
                "Tell me about the calculation of leave with wages for mine workers below ground.",
                "Can you provide information on Forms G and H for maintaining leave records with wages?",
                "Discuss the maintenance of records for leave with wages in mines."
            ],
            "responses": [
                "Every person employed in a mine who has completed a calendar year service therein shall be allowed, during the subsequent calendar year, leave with wages calculated:\n in the case of a person employed below ground at the rate of 1 day for every 15 days of work performed by him,\n in any other case, at the rate of 1 day for every 20 days of work performed by him/her.\nThe owner, agent, or manager of every mine shall maintain, in respect of every employee thereof, a record of leave with wages in Form G and H.",
                "The leave with wages policy in mines allows every person employed who has completed a calendar year of service to be granted leave with wages during the subsequent calendar year. The calculation is at the rate of 1 day for every 15 days of work performed for a person employed below ground and 1 day for every 20 days of work for others. The owner, agent, or manager must maintain a record of leave with wages in Form G and H.",
                "Rules for leave with wages for mine employees stipulate that every person employed, having completed a calendar year of service, shall be entitled to leave with wages in the subsequent calendar year. The calculation is at the rate of 1 day for every 15 days of work for those employed below ground and 1 day for every 20 days of work for others. Records of leave with wages are maintained in Form G and H.",
                "Leave with wages for mine workers is calculated based on the completion of a calendar year of service. The rate is 1 day for every 15 days of work for a person employed below ground and 1 day for every 20 days of work for others. The owner, agent, or manager maintains records of leave with wages in Form G and H.",
                "The policy for leave with wages in mines entitles every person employed, having completed a calendar year of service, to leave with wages in the subsequent calendar year. The calculation is at the rate of 1 day for every 15 days of work for those employed below ground and 1 day for every 20 days of work for others. Records are maintained in Form G and H.",
                "Provisions for leave with wages in the mining industry allow every person employed, after completing a calendar year of service, to be granted leave with wages in the subsequent calendar year. The calculation is at the rate of 1 day for every 15 days of work for a person employed below ground and 1 day for every 20 days of work for others. Records are kept in Form G and H.",
                "Calculation of leave with wages for mine workers involves granting leave at the rate of 1 day for every 15 days of work for those employed below ground and 1 day for every 20 days of work for others. Records of leave with wages are maintained by the owner, agent, or manager in Form G and H.",
                "Record-keeping for leave with wages in mines involves maintaining details of every person employed who has completed a calendar year of service. The calculation is at the rate of 1 day for every 15 days of work for those employed below ground and 1 day for every 20 days of work for others. Forms G and H are used for this purpose.",
                "The formula for calculating leave with wages in mines is based on the completion of a calendar year of service. It is granted at the rate of 1 day for every 15 days of work for those employed below ground and 1 day for every 20 days of work for others. Records are maintained in Form G and H.",
                "Conditions for granting leave with wages to mine employees involve the completion of a calendar year of service. The calculation is at the rate of 1 day for every 15 days of work for those employed below ground and 1 day for every 20 days of work for others. Records are maintained in Form G and H.",
                "Elaborating on the leave with wages policy for mine workers, every person employed, having completed a calendar year of service, is entitled to leave with wages in the subsequent calendar year. The calculation is at the rate of 1 day for every 15 days of work for those employed below ground and 1 day for every 20 days of work for others. Records are kept in Form G and H.",
                "The entitlement of leave with wages in the mining sector allows every person employed, having completed a calendar year of service, to be granted leave in the subsequent calendar year. The calculation is at the rate of 1 day for every 15 days of work for those employed below ground and 1 day for every 20 days of work for others. Records are maintained in Form G and H.",
                "Regulations for leave with wages for mine employees specify that every person employed, having completed a calendar year of service, shall be entitled to leave with wages in the subsequent calendar year. The calculation is at the rate of 1 day for every 15 days of work for those employed below ground and 1 day for every 20 days of work for others. Records are kept in Form G and H.",
                "Record-keeping forms for leave with wages in mines include Forms G and H. These forms are used to maintain records of every person employed who has completed a calendar year of service. The calculation is at the rate of 1 day for every 15 days of work for those employed below ground and 1 day for every 20 days of work for others.",
                "Leave with wages for mine workers below ground is granted at the rate of 1 day for every 15 days of work, and for others, it is at the rate of 1 day for every 20 days of work. Records of leave with wages are maintained by the owner, agent, or manager in Form G and H.",
                "Provisions for leave with wages for mine workers involve granting leave at the rate of 1 day for every 15 days of work for those employed below ground and 1 day for every 20 days of work for others. Records of leave with wages are maintained by the owner, agent, or manager in Form G and H.",
                "The policy for granting leave with wages to mine employees is based on completing a calendar year of service. The calculation is at the rate of 1 day for every 15 days of work for those employed below ground and 1 day for every 20 days of work for others. Records are maintained in Form G and H.",
                "Calculation of leave with wages for mine workers involves granting leave at the rate of 1 day for every 15 days of work for those employed below ground and 1 day for every 20 days of work for others. Records of leave with wages are maintained by the owner, agent, or manager in Form G and H.",
                "Information on Forms G and H for maintaining leave records with wages involves recording details of every person employed who has completed a calendar year of service. The calculation is at the rate of 1 day for every 15 days of work for those employed below ground and 1 day for every 20 days of work for others.",
                "Maintenance of records for leave with wages in mines involves keeping details of every person employed who has completed a calendar year of service. The calculation is at the rate of 1 day for every 15 days of work for those employed below ground and 1 day for every 20 days of work for others."
            ]
        }

    ]
}
