{
    "intents": [
         {
            "tag": "mining_rules_list",
            "patterns": [
                "What are different rules in the mining industry?",
                "Can you list some rules for mining?",
                "Tell me about key regulations in mining.",
                "List the important rules for the mining sector.",
                "What rules govern mining activities?",
                "Explain the regulatory framework for mining.",
                "Share information on mining industry guidelines.",
                "What are the legal requirements for mining operations?",
                "Discuss the rules and regulations in the mining sector.",
                "Can you provide an overview of mining industry standards?",
                "Tell me about the specific rules for mineral extraction.",
                "Explain the laws surrounding mining activities.",
                "List some important rules for responsible mining.",
                "Discuss the key regulations for environmental protection in mining.",
                "What governmental regulations apply to mining?",
                "Explain the role of regulatory bodies in the mining sector.",
                "Are there specific rules for sustainable mining practices?",
                "Tell me about the licensing process for mining operations.",
                "What safety measures are mandated in the mining industry?",
                "Share insights into the rules governing granite conservation in mining."
            ],
            "responses": [
                "Some key rules in the mining industry include:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "Mining regulations play a crucial role in governing activities. Some notable rules are:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "Key regulations in the mining industry include:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "Listed below are some important rules for the mining sector:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "The regulatory framework for mining includes key rules such as:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "Mining industry guidelines encompass rules like:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "Legal requirements for mining operations are outlined in key rules such as:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "Mining sector rules and regulations include:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "An overview of mining industry standards reveals rules like:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999",
                "Specific rules for mineral extraction include:\n1. The Mineral Concession Rules, 1960\n2. The Mineral Conservation and Development Rules, 1988\n3. The Mines and Minerals (Development and Regulation) Act, 1957\n4. The Granite Conservation and Development Rules, 1999"
            ]
        },
                {
            "tag": "injured_worker_rights",
            "patterns": [
                "What rights does a person have if they get injured at work?",
                "Can you explain the rights of an employee injured on the job?",
                "What protections are available for workers who suffer injuries in the workplace?",
                "If someone gets hurt at work, what legal rights do they have?",
                "Tell me about the rights of an injured worker.",
                "What are the legal remedies for employees injured during work?",
                "Explain the worker's rights in case of workplace injuries.",
                "If an employee is injured, what entitlements do they have?",
                "Discuss the legal aspects of workplace injuries and employee rights.",
                "What compensation rights does an injured worker have?",
                "Can you list the rights of an employee who sustains an injury at work?",
                "Explain the employer's responsibilities for an injured worker.",
                "What laws protect workers injured on the job?",
                "Tell me about the rights of injured workers according to labor laws.",
                "In case of a workplace injury, what rights does the employee retain?",
                "Discuss the legal recourse for workers injured during employment.",
                "What steps should an injured worker take to protect their rights?",
                "Tell me about the benefits and rights for employees injured at work.",
                "Explain the process of filing a claim for a workplace injury.",
                "What legal options are available to an injured employee in the workplace?"
            ],
            "responses": [
                "When a person is injured at work, they may be entitled to workers' compensation benefits.",
                "Injured workers typically have the right to receive medical treatment and compensation for lost wages.",
                "Workers injured on the job have the right to file a workers' compensation claim.",
                "Employers are generally obligated to provide a safe working environment and compensation for injured employees.",
                "Legal rights for injured workers often include medical care, disability benefits, and rehabilitation services.",
                "Workers' compensation laws vary, but they commonly cover medical expenses and a portion of lost wages.",
                "Injured employees may have the right to pursue legal action against a third party if their injury was caused by someone other than their employer.",
                "Employers are generally prohibited from retaliating against employees who exercise their rights to workers' compensation.",
                "Injured workers have the right to report workplace injuries and file a workers' compensation claim.",
                "Workers' compensation benefits may include coverage for medical bills, rehabilitation, and disability benefits.",
                "Workers' compensation laws are designed to provide a swift resolution for injured employees without the need for lengthy legal battles.",
                "Employees injured at work may have the right to choose their own healthcare provider for treatment.",
                "Injured workers have the right to request an investigation into the circumstances that led to their injury.",
                "Workers' compensation benefits aim to provide financial support and aid in the recovery of injured employees.",
                "Employers are typically required to carry workers' compensation insurance to cover injured workers.",
                "Injured workers may be entitled to vocational rehabilitation services to help them return to work.",
                "Workers' compensation laws protect both the rights of the employee and the employer in the event of a workplace injury.",
                "Injured workers should promptly report their injuries to their employer to preserve their rights to compensation.",
                "Legal rights for injured workers may extend to compensation for pain and suffering.",
                "Workers injured on the job may have the right to appeal decisions related to their workers' compensation claim."
            ]
        },
    {
        "tag": "crop_yield_prediction",
        "patterns": [
            "How much crop yield can I expect per hectare?",
            "What will be my crop yield in tonnes per hectare?",
            "Can you predict the expected crop yield for my field?",
            "I need to estimate my crop yield. Any advice?",
            "Based on my field conditions, what could be the expected yield?",
            "What factors influence crop yield per hectare?",
            "How does temperature affect crop yield?",
            "What role does humidity play in determining crop yield?",
            "Can you provide insights into estimating crop yield based on soil type?",
            "I want to know the expected crop yield considering the current weather conditions.",
            "How can I predict crop yield with information about temperature and humidity?",
            "Tell me about crop yield estimation techniques.",
            "Considering my field's soil type, what will be the expected yield?",
            "What is the correlation between temperature and crop yield?",
            "How does soil quality impact the potential crop yield?",
            "Provide guidance on predicting crop yield using environmental factors.",
            "What tools or methods can I use to forecast crop yield?",
            "How can I optimize my field conditions for better crop yield?",
            "What are the best practices for maximizing crop yield per hectare?",
            "Share recommendations for improving crop yield based on environmental factors.",
            "What is the average crop yield per hectare in my region?",
            "How can I assess the potential yield of my crops?",
            "What are the critical factors affecting crop yield?",
            "Tell me about precision agriculture techniques for predicting crop yield.",
            "How can historical weather data help in estimating crop yield?",
            "Can you guide me on using technology for crop yield forecasting?",
            "What role does irrigation play in determining crop yield?",
            "How can I account for pests and diseases when estimating crop yield?",
            "Tell me about advancements in crop yield prediction models.",
            "What data should I collect to improve crop yield predictions?",
            "How does the time of planting affect crop yield?",
            "Can you provide tips for sustainable practices that enhance crop yield?",
            "How do different crop varieties respond to varying environmental conditions?",
            "What is the impact of climate change on crop yield predictions?",
            "Tell me about the importance of accurate crop yield estimates for farmers.",
            "How can I integrate data from remote sensing for better crop yield predictions?",
            "What are the limitations of current crop yield prediction models?",
            "How do market conditions influence crop yield expectations?",
            "What are the key considerations for predicting crop yield in organic farming?",
            "Tell me about government initiatives supporting accurate crop yield predictions.",
            "How can I analyze the economic viability of different crop yield scenarios?",
            "What role does crop rotation play in maximizing yield?",
            "How can I interpret soil test results to estimate crop yield?",
            "Tell me about the impact of land management practices on crop yield.",
            "Can you explain the concept of yield potential in agriculture?",
            "How can I adjust my farming practices for better crop yield during extreme weather events?",
            "What are the challenges in predicting crop yield for small-scale farmers?",
            "How do different crops respond to changes in atmospheric conditions?"
         
        ],
        "responses": [
            "Please provide details asked  I Will help you with yield "
          
        ]
    },
     {
        "tag": "crop_recommendation",
        "patterns": [
            "What crop should I grow in my field considering the soil and weather conditions?",
            "Can you recommend the best crop based on my soil type and weather parameters?",
            "I need advice on choosing the right crop for my farm. Any recommendations?",
            "Considering my field's soil and weather, which crop is most suitable?",
            "Tell me about crops that thrive in my specific soil and weather conditions.",
            "How can I determine the best crop to grow based on soil and weather parameters?",
            "What factors should I consider when choosing a crop for my farm?",
            "Can you suggest a crop that is well-suited to my soil and climate?",
            "I want to optimize my crop selection based on soil and weather. Any suggestions?",
            "What crops are recommended for my region's soil and temperature?",
            "Which crop varieties are suitable for my soil type and current weather conditions?",
            "Tell me about crop recommendations for specific soil types.",
            "How does soil pH impact crop selection, and what crops are best for my soil pH?",
            "Can you guide me on selecting crops that are resistant to pests in my region?",
            "I'm looking for advice on choosing crops that can tolerate high temperatures and specific soil conditions.",
            "What are the best practices for crop selection in areas with varying climatic conditions?",
            "Which crops are known to thrive in regions with black soil?",
            "How can I choose crops that are well-suited for organic farming in my soil?",
            "Tell me about crops that are resilient to drought conditions in my area.",
            "Can you provide recommendations for crops that grow well in sandy soil?",
            "What crops are suitable for regions with high humidity and specific soil characteristics?",
            "Which crops are recommended for areas with low rainfall and specific soil types?",
            "Tell me about crops that can withstand frost in my region.",
            "How can I choose crops that are well-adapted to the monsoon season and my soil type?",
            "Can you suggest crops that require less water for cultivation in my area?",
            "What are the best crops for sustainable farming practices in my soil and climate?",
            "I want to diversify my crops. Any recommendations based on soil and weather?",
            "Tell me about crops that have a short growing season and are suitable for my region.",
            "How does the elevation of my farm impact crop selection, and what crops are recommended?",
            "Can you recommend crops that are suitable for intercropping in my soil and climate?",
            "What crops are known for improving soil fertility in my region?",
            "How can I select crops that complement each other in a crop rotation plan?",
            "Tell me about the impact of wind speed on crop selection, and which crops are wind-resistant?",
            "Can you suggest crops that are well-suited for terrace farming in my soil and climate?",
            "What crops are recommended for areas with specific microclimates?",
            "Tell me about crops that require minimal pesticide use in my region.",
            "Can you recommend crops that contribute to biodiversity in my agricultural ecosystem?",
            "What are the best crops for agroforestry in my soil and climate?",
            "I'm interested in growing cover crops. Any recommendations based on my soil type?",
            "Tell me about crops that are suitable for greenhouse cultivation in my region.",
            "How can I select crops that promote soil conservation in my farming practices?",
            "Can you recommend crops that are suitable for vertical farming in my soil and climate?",
            "What are the best crops for hydroponic cultivation in my region?",
            "Tell me about crops that have high market demand and are suitable for my soil and climate.",
            "How can I choose crops that are well-suited for export in my region?"
           
        ],
        "responses": [
            "please provide details here we will recommend the  better crop"
          
        ]
    },
     {
        "tag": "fertilizer_recommendation",
        "patterns": [
            "What fertilizer should I use for my soil type?",
            "Can you recommend the best fertilizer for my specific soil conditions?",
            "I need advice on choosing the right fertilizer for my farm. Any recommendations?",
            "Considering my soil type, which fertilizer is most suitable?",
            "Tell me about fertilizers that work well with my specific soil.",
            "How can I determine the best fertilizer to use based on soil conditions?",
            "What factors should I consider when selecting a fertilizer for my farm?",
            "Can you suggest a fertilizer that complements my soil type?",
            "I want to optimize my fertilizer selection based on soil conditions. Any suggestions?",
            "What fertilizers are recommended for my region's soil type?",
            "Which fertilizer types are suitable for my soil characteristics?",
            "Tell me about fertilizer recommendations for specific soil types.",
            "How does soil pH impact fertilizer selection, and what fertilizer is best for my soil pH?",
            "Can you guide me on selecting fertilizers that promote crop growth in my region?",
            "I'm looking for advice on choosing fertilizers that address nutrient deficiencies in my soil.",
            "What are the best practices for fertilizer selection in areas with varying soil conditions?",
            "Which fertilizers are known to work well in regions with black soil?",
            "How can I choose fertilizers that are suitable for organic farming in my soil?",
            "Tell me about fertilizers that address nutrient deficiencies in sandy soil.",
            "What fertilizers are suitable for regions with high humidity and specific soil characteristics?",
            "Which fertilizers are recommended for areas with low rainfall and specific soil types?",
            "Tell me about fertilizers that can address nutrient deficiencies in my soil during frost conditions.",
            "How can I choose fertilizers that are well-suited to the monsoon season and my soil type?",
            "Can you suggest fertilizers that provide adequate nutrition with less water in my area?",
            "What are the best fertilizers for sustainable farming practices in my soil and climate?",
            "I want to enhance soil fertility. Any recommendations for fertilizers based on soil type?",
            "Tell me about fertilizers that have a short release time and are suitable for my region.",
            "How does the elevation of my farm impact fertilizer selection, and what fertilizers are recommended?",
            "Can you recommend fertilizers that work well for intercropping in my soil and climate?",
            "What fertilizers are known for improving soil fertility in my region?",
            "How can I select fertilizers that complement each other in a crop rotation plan?",
            "Tell me about fertilizers that are suitable for greenhouse cultivation in my region.",
            "How can I choose fertilizers that promote soil conservation in my farming practices?",
            "Can you recommend fertilizers that are suitable for vertical farming in my soil and climate?",
            "What are the best fertilizers for hydroponic cultivation in my region?",
            "Tell me about fertilizers that are suitable for terrace farming in my soil and climate.",
            "How can I select fertilizers that contribute to biodiversity in my agricultural ecosystem?",
            "What are the best fertilizers for agroforestry in my soil and climate?",
            "I'm interested in using organic fertilizers. Any recommendations based on my soil type?",
            "Tell me about fertilizers that are suitable for foliar application in my region.",
            "How can I choose fertilizers that are well-suited for fertigation in my soil and climate?",
            "What are the best fertilizers for drip irrigation in my region?",
            "Tell me about slow-release fertilizers and their suitability for my soil and climate."
           
        ],
        "responses": [
            "please provide the details we need we will recommend the better fertliser for your soil: "
           
        ]
    },
    {
        "tag": "plant_disease_solution",
        "patterns": [
            "How can I identify diseases in my plants?",
            "What are the common signs of plant diseases?",
            "Can you help me diagnose diseases affecting my crops?",
            "I suspect my plants have a disease. How can I be sure?",
            "Tell me about common plant diseases and their symptoms.",
            "What steps should I take to identify diseases in my plants?",
            "How do I recognize the signs of fungal infections in my crops?",
            "What are the visual indicators of bacterial infections in plants?",
            "Can you guide me on identifying viral diseases affecting my crops?",
            "I need assistance in diagnosing diseases in my specific crop. Any advice?",
            "What measures can I take to prevent plant diseases?",
            "How do environmental conditions contribute to plant diseases?",
            "Tell me about the impact of soil health on plant disease development.",
            "Can you provide insights into pest-related plant diseases and their identification?",
            "I'm concerned about leaf diseases in my plants. How can I identify and treat them?",
            "What role do insects play in spreading plant diseases?",
            "How can I identify and manage root diseases in my crops?",
            "Can you suggest a systematic approach for disease diagnosis in my plants?",
            "I want to learn about common diseases affecting fruit-bearing plants. Any information?",
            "What measures should I take to prevent the spread of diseases between plants?",
            "Tell me about the role of crop rotation in disease management.",
            "How does watering practices impact the susceptibility of plants to diseases?",
            "Can you recommend resources for learning more about plant diseases and their solutions?",
            "I'm noticing discoloration in my plant leaves. What could be the cause and solution?",
            "What are the most common diseases affecting crops in my region?",
            "How can I differentiate between nutritional deficiencies and diseases in my plants?",
            "Tell me about effective organic solutions for managing plant diseases.",
            "Can you guide me on using biopesticides to control plant diseases?",
            "What preventive measures should I take during different growth stages to avoid diseases?",
            "How do weather conditions influence the prevalence of plant diseases?",
            "Tell me about cultural practices that can help prevent plant diseases.",
            "What role does pruning play in disease management for fruit trees?",
            "How can I implement integrated pest management for disease control?",
            "Can you recommend disease-resistant crop varieties suitable for my region?",
            "I need advice on treating a specific disease in my plants. What should I do?",
            "Tell me about the importance of early detection and intervention in disease management.",
            "How can I make my own organic fungicides for plant disease control?",
            "What are the symptoms of soil-borne diseases, and how can I address them?",
            "Can you guide me on diagnosing and treating wilt diseases in my crops?",
            "I suspect my plants have a bacterial infection. What steps should I take?",
            "Tell me about the impact of overwatering on plant health and disease susceptibility.",
            "What are some natural remedies for controlling aphids and preventing virus transmission?",
            "How can I manage powdery mildew in my plants?",
            "Can you recommend effective measures for controlling downy mildew in crops?",
            "Tell me about the importance of quarantine procedures in disease management."
            
        ],
        "responses": [
            "please upload the  clear image of leaf : "
          
        ]
    }

    ]
}
